{"New": [{"Introduction and Purpose": ["Key points:\n- All banks licensed by the Central Bank of the UAE must ensure that Pillar 1 risks are mitigated by capital.\n- Each bank is required to have a process to assess its overall capital adequacy as a function of its risk profile and its strategy.\n- Each bank is required to maintain appropriate capital levels in accordance with the Central Bank Standards on Pillar 2 capital.\n- The ICAAP is a critical reference for supervision and for the supervisory dialogue between banks and Central Bank.\n- This Guidance presents minimum expected practices to be considered by each bank in order to undertake their ICAAP, covering the process, content, outcome, and usage.\n- It also intends to support each bank in the identification, measurement, reporting, and mitigation of Pillar 2 risks.\n- All methodologies employed by a bank for its ICAAP should be relevant to its business model, risk profile, to the geographies of its exposures, and, in particular, to the features of the UAE economy.\n- The Central Bank may apply proportionality for smaller and less complex banks when evaluating the ICAAP.\n- This Guidance serves several purposes. It (i) Explains in more detail the Central Bank’s expectations on fulfilling the requirements of the ICAAP Capital Standards, in particular, related to the ICAAP (process) at each bank and certain aspects of the content of the ICAAP report; (ii) Covers expectations on some processual elements of the ICAAP, such as an appropriate approval process of the ICAAP report and its submission timelines; and (iii) Formulates expectations about additional sections of the ICAAP report (e.g. related to internal audit findings and changes compared to the previous ICAAP report)."]}, {"ICAAP Executive Summary": ["The executive summary of the ICAAP document should contain the following elements:\n- The main findings of the ICAAP\n- A brief description of the ICAAP governance framework\n- A brief presentation of the bank's structure, subsidiaries, businesses, material risks, risk appetite, and risk mitigating actions, where applicable\n- A description of the current capital position of the bank showing the allocation of capital per risk type, covering Pillar 1 and Pillar 2 risks\n- A description of the current capital composition of the bank against minimum capital requirements covering at least CET1, AT1, and Tier 2 capital ratios\n- A forward-looking analysis of the budgeted capital position of the bank, based on the bank's expected business plan over the next three (3) years, reflecting the current, and expected economic conditions. This needs to cover expected dividend distribution\n- An analysis of the capital position and capital ratios under several stress scenarios, the analysis of the stress scenarios should include the intended risk mitigation actions\n- An assessment of the adequacy of the bank's risk management processes including critical judgment on the areas that need improvement\n- A conclusion of the ICAAP addressing the suitability of the capital to cover the bank's current and expected risks"]}, {"ICAAP Governance": ["Key points:\n- The Board has ultimate ownership and responsibility of the ICAAP. It is required to approve an ICAAP on a yearly basis.\n- The Board is also expected to approve the ICAAP governance framework with a clear and transparent assignment of responsibilities, adhering to the segregation of functions.\n- The policy framework should be approved by the Board. Senior Management has to implement the framework via effective procedures and systems.\n- The framework must include measures reflected in the ICAAP report applied in day-to-day business and supported by suitable MIS at appropriate frequencies."]}, {"ICAAP Methodology, Scope and Use Test": ["The following are the major/critical/important points in this section:\n1. The ICAAP is an ongoing process. On an annual basis, every bank is required to submit a document outlining the outcome of the ICAAP to the Central Bank.\n2. The ICAAP supplements the Pillar 1 minimum regulatory capital requirements by (i) identifying risks that are not addressed or not fully addressed through Pillar 1 regulations, referred to as Pillar 2 risks, and (ii) determining a level of capital commensurate with the level of risk.\n3. The Central Bank requires each bank to adopt a Pillar 1 plus approach. According to this, the bank’s total capital requirements include the minimum Pillar 1 regulatory capital requirements, plus the capital required to cover Pillar 2 risks. As a result, the ICAAP should result in additional capital requirements specific to each bank’s business model.\n4. Board and Senior Management are responsible to deliver a comprehensive, effective, and accurate assessment of capital adequacy. Each bank is consequently required to conduct an ICAAP supported by appropriate methods and procedures to ensure that adequate capital covers all material risks.\n5. The frequency of reporting to the Board is expected to be at least quarterly, but, depending on the size, complexity, business model, risk types of the institution, and the market environment, reporting might need to be more frequent to ensure timely management actions.\n6. The ICAAP should be supported by robust methodologies and data. All models used directly or indirectly in the ICAAP should follow the bank’s model management framework, in compliance with the Central Bank Standards and Guidance. The data employed in the ICAAP should be comprehensive, reliable, follow rigorous quality checks, and control mechanisms."]}, {"Capital Planning": ["**Key Points**\n\n1. The ICAAP should be forward-looking taking into account both internal and external drivers over a period covering three (3) to five (5) years.\n2. The multi-year capital forecast should be assessed and calibrated through two perspectives: Pillar 1 and Pillar 2.\n3. For each internal stress test scenario for capital planning purposes, each bank is expected to consider credible, quantifiable management actions that the bank could practically take to mitigate any capital impact of stress scenarios.\n4. The following elements should be included in the ICAAP report or related appendix:\n    * Assumptions related to business developments over the forecasted period\n    * Assumptions related to the economic environment over the forecasted period\n    * Summary of historic capital base, aggregate RWAs, and CAR ratios for a minimum of five (5) years\n    * Disclosure of the following forecasted financial projections:\n        * Detailed balance sheet\n        * Detailed statement of profit and loss\n        * Break down of Capital base into its regulatory components\n        * Break down of Risk Weighted Assets (RWAs) components\n        * Significant ratios (e.g. CET 1, Tier 1, and CAR)\n        * A method to calibrate capital needs to the current and expected levels of risks, in coherence with the bank’s risk appetite, business plan, and strategy\n        * It should include the likely future constraints on the availability and the use of capital\n        * Any future regulatory and accounting changes that can potentially impact such plan.\n5. Banks are required to fulfill internal risk appetite requirements in the bank’s self-assessment of Pillar 1 and Pillar 2 minimum regulatory capital requirements.\n6. The capital planning should not be limited to risk-based capital ratios but should also consider the leverage ratio of the bank.\n7. Bank should analyse and consider unaccounted foreseeable events in the capital plan, e.g. regulatory changes like the revised standardised approaches for credit, market and operational risk."]}, {"Material Risks": ["166  CBUAE Classification: Public J. Other Risks 103. Banks are also expected to take into account other risks, such as legal risk, reputational risk, and sovereign risk. The Central Bank does not expect banks to perform a detailed analysis of all of these risks. However, each bank should provide a high-level overview of the main risks it is exposed to, the policies and procedures in place to address these risks, and the metrics used to monitor the evolution of these risks."]}, {"ICAAP Stress Test and Reverse Stress Test": ["Major/Critical/Important points:\n- Stress tests are used to improve the bank's understanding of the vulnerabilities that it faces under exceptional, but plausible events, and provide the bank with an indication of how much capital might be needed to absorb losses if such events occur.\n- Stress tests should be conducted regularly and should cover all material risks on a bank-wide basis.\n- The Board is responsible for the effective implementation of the stress tests framework and for oversight of the stress testing execution.\n- The frequency of stress test exercises should depend on their type, scope, depth, and on the wider economic context.\n- Stress test scenarios should be designed to capture the risks and potential losses appropriately, in coherence with the characteristics of each bank's risk profile and portfolio.\n- The process of stress tests should be supported by robust and documented methodologies.\n- Stress tests should support decision-making throughout the bank effectively.\n- Reverse stress tests should be conducted at least once a year."]}, {"ICAAP Submission and Approval": ["The ICAAP report should be submitted to the Central Bank on or before the following dates:\n- Public Banks: 15/03/2022 for FY2022 and 01/03 for FY2023 onwards\n- Large banks: FAB, ENBD, ADCB, DIB, Mashreq, ADIB, CBD 31/03/2022 for FY2022 and 31/03 for FY2023 onwards\n- Other local banks and HSBC, Standard Chartered Bank, Citibank, Arab Bank, and Bank of Baroda 15/04/2022 for FY2022 and 15/04 for FY2023 onwards\n- Other Foreign Banks 15/04/2022 for FY2022 and 15/04 for FY2023 onwards\nThe ICAAP report should be approved by:\n- Senior Management (including the CRO)\n- Board or Board risk committee, and Senior Management for all local banks\n- The managing director and/ or relevant highest committee of the bank in the UAE, and by (b) their head office, stating that the ICAAP assumptions and forecasts are in line with the group’s assumptions, forecasts, and that the group’s Board approves/ endorse the results of the ICAAP"]}], "Old": [{"Introduction and Scope": ["1. Banks are only permitted to perform a Pillar I Plus approach. Internal models are not allowed in ICAAP for estimating capital requirements for credit, market or operational risk.\n2. All buffers are to be in addition to existing requirements. An off-setting of certain requirements is not permitted i.e. lower Pillar 2 for Pillar 1 risks are not allowed.\n3. The type of capital which the Central Bank will require banks to provide  for pillar 2 risks will be solely at the discretion of the Central Bank; this may be CET1 only, or a mix between CET1 , AT1 and Tier 2.\n4. It should be noted that given a normal business model the capital risk charge for Pillar 2 should always be positive if the risk exists (in particular for the IRRBB and Concentration risk)."]}, {"Definitions": [null]}, {"Importance of supervisory review": [null]}, {"Four key principles of supervisory review": ["Principle 5: The Central Bank will review the bank’s capital adequacy on an ongoing basis and will require banks to submit regular reports on their capital adequacy.  61. The Central Bank will require banks to report their capital adequacy on a regular basis (e.g. quarterly) to enable the Central Bank to monitor the banks’ capital positions and to identify trends and changes in risk profiles. The reports should include information on the bank’s overall capital position, as well as information on the bank’s risk profile and capital adequacy in relation to specific risk types (e.g. credit risk, market risk, operational risk, liquidity risk). The Central Bank may also require banks to submit additional information on an ad hoc basis.  165  CBUAE Classification: Restricted  62. The Central Bank will review the results of the reports submitted by banks and will take any necessary supervisory actions if it is not satisfied with the bank’s capital adequacy or with the bank’s risk management policies and procedures. These actions may include, but are not limited to, intensifying the monitoring of the bank, restricting the payment of dividends, requiring the bank to prepare and implement a satisfactory capital adequacy restoration plan, and requiring the bank to raise additional capital immediately. The Central Bank will also review the bank’s capital adequacy in the context of its overall supervisory assessment of the bank.  63. In addition, the Central Bank will review the bank’s capital adequacy in the context of its overall supervisory assessment of the bank. The Central Bank will take into account the bank’s risk profile, its capital adequacy, its risk management policies and procedures, and its overall financial condition. The Central Bank will also consider the bank’s capacity to generate new capital.  64. The Central Bank will require banks to provide information on their capital adequacy on a regular basis, including information on the bank’s overall capital position, as well as information on the bank’s risk profile and capital adequacy in relation to specific risk types. The Central Bank may also require banks to submit additional information on an ad hoc basis.  65. The Central Bank will review the results of the reports submitted by banks and will take any necessary supervisory actions if it is not satisfied with the bank’s capital adequacy or with the bank’s risk management policies and procedures. These actions may include, but are not limited to, intensifying the monitoring of the bank, restricting the payment of dividends, requiring the bank to prepare and implement a satisfactory capital adequacy restoration plan, and requiring the bank to raise additional capital immediately. The Central Bank will also review the bank’s capital adequacy in the context of its overall supervisory assessment of the bank.  66. The Central Bank will take into account the bank’s risk profile, its capital adequacy, its risk management policies and procedures, and its overall financial condition. The Central Bank will also consider the bank’s capacity to generate new capital.  67. The Central Bank will review the bank’s capital adequacy on an ongoing basis and will require banks to submit regular reports on their capital adequacy."]}, {"Specific issues to be addressed under the supervisory": ["**Major/critical/important points for the risk team:**\n\n* The risk appetite statement defines the organization's overall risk tolerance and provides guidance for risk management decisions.\n* The risk management framework establishes the processes, policies, and procedures for managing risk.\n* The risk register identifies, assesses, and prioritizes risks.\n* The risk mitigation plan outlines the strategies for reducing or eliminating risks.\n* The risk monitoring process tracks risks and ensures that the risk mitigation plan is effective.\n\nThese are the key elements of a risk management framework that will help the risk team identify, assess, and manage risks."]}, {"review process": ["136. The Central Bank expects banks to provide the following information to the Central Bank:  i. The results of stress testing results under a range of scenarios, including macroeconomic, market, credit and liquidity shocks, as well as operational and reputational risk shocks,  ii. The impact of the stress testing results on capital adequacy ratios,  iii. The impact of the stress testing results on a bank’s capital planning process,  iv. The key assumptions driving stress testing results,  v. The use of stress testing in informing the decision-making process, and  vi. The plan of corrective action to address any material shortcomings in the stress testing programme."]}, {"Other aspects of the supervisory review process": ["Key points: 1. The Central Bank will monitor, as appropriate, whether banks have done so adequately.\n2. If the risk transfer is considered insufficient or non-existent, the Central Bank will require the application of a higher capital requirement than prescribed under Pillar 1 or, alternatively, may deny a bank from obtaining any capital relief from the securitisations.\n3. Banks either underestimated or did not anticipate that a market-wide disruption could prevent them from securitising warehoused or pipeline exposures and did not anticipate the effect this could have on liquidity, earnings and capital adequacy.\n4. A bank must conduct analyses of the underlying risks when investing in the structured products and must not solely rely on the external credit ratings assigned to securitisation exposures by the credit rating agencies.\n5. The Central Bank will be vigilant in determining implicit support and will take appropriate supervisory action to mitigate the effects.\n6. The Central Bank expects that the sophistication of a bank’s system in monitoring the likelihood and risks of an early amortisation event will be commensurate with the size and complexity of the bank’s securitisation activities that involve early amortisation provisions."]}, {"Shari’ah Implementation": ["Banks providing Islamic financial services must comply with the requirements and provisions of this standard for their Shari’ah compliant transactions that are alternative to transactions referred to in this Standard, provided it is acceptable by Islamic Shari’ah. This is applicable until relevant standards and/or guidance are issued specifically for transactions of banks offering Islamic financial services.\n\nThis means that banks offering Islamic financial services must ensure that their transactions are Shari’ah compliant, and that they comply with the requirements and provisions of this standard. This is important because it helps to ensure that these banks are operating in a manner that is consistent with Islamic law.\n\nIn addition, banks offering Islamic financial services must ensure that they are aware of any relevant standards and/or guidance that are issued specifically for their transactions. This will help them to ensure that they are complying with all applicable requirements."]}], "Added": [{"Internal Control Review": ["1. Internal control functions should perform regular reviews of the risk management process to make sure its coherence, validity, and rationality.\n2. The review of the ICAAP should cover the following:\n    (i) Ensuring that the ICAAP is complete and suitable as of the bank’s context, operational conditions, the reliability of controls behind it;\n    (ii) The process of identifying all material risks;\n    (iii) Efficiency of the information systems that support the ICAAP;\n    (iv) Ensuring that the measurement methodologies in use are suitable to support the ICAAP valuation;\n    (v) Ensuring the accuracy, and comprehensive of the data input to the ICAAP;\n    (vi) Rational behind the ICAAP output and assumptions in use;\n    (vii) Rational and suitability of stress tests and analysis of assumptions;\n    (viii) Consolidation of the ICAAP outcomes with the risk management (e.g., limit setting and monitoring); and\n    (ix) Rational of the capital plan and internal capital targets.\n3. The role and validity of internal control functions are also important and should be verified with regard to other topics. For example:\n    (i) All risk quantification methodologies and models must be subject to independent validation (internal/ external); and\n    (ii) Internal Audit should perform an independent review of the bank’s capital framework implementation every year in accordance with the Capital Standards.  If the Central Bank is not satisfied with the quality of work performed by the bank’s Internal Audit function, the Central Bank may require an external review."]}, {"Appendices": ["- ICAAP Mandatory disclosure form (Table 2)\n\n- ICAAP Executive Summary (Table 3)\n\n- Governance and Risk Management (Appendix 3)\n\n- Models (Appendix 3)\n\n- Reverse Stress Testing (Appendix 3)\n\n- Supplementary Content Required in an ICAAP Report (Appendix 3)"]}], "Removed": []}